#include<iostream>
#include<cmath>
using namespace std;

int main()
{
	cout << "请输入年，月，日" << endl;
	int a, b, c,d;
	cin >> a >> b >> c;          //a是年，b是月，c是日
	switch (b) {
		case 1:
			if (c >= 0 && c <= 31) {
				d = c;
				cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
			}
			else {
				cout << "输入错误-日与月的关系非法" << endl;
			}
			break;
		case 2:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 29 && c >= 0) {
					d = 31 + c;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 28 && c >= 0) {
					d = 31 + c;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 3:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 4:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 30 && c >= 0) {
					d = 31 + c + 29+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 30 && c >= 0) {
					d = 31 + c + 28+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 5:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 6:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 30 && c >= 0) {
					d = 31 + c + 29 + 31 + 30+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 30 && c >= 0) {
					d = 31 +31+ c + 28 + 31 + 30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 7:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 8:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31 + 30+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30 + 31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 9:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 30 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31 + 30 + 31+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 30 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30 + 31 + 31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 10:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31 + 30 + 31 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 11:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 30 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30+31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 30 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		case 12:
			if ((a % 4 == 0) && (a % 100 != 0) || (a % 400 == 0)) {   //真，则为闰年,二月有29天
				if (c <= 31 && c >= 0) {
					d = 31 + c + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
			else {
				if (c <= 31 && c >= 0) {
					d = 31 + c + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31+30;
					cout << a << "-" << b << "-" << c << "是" << a << "年的第" << d << "天" << endl;
				}
				else {
					cout << "输入错误-日与月的关系非法" << endl;
				}
				break;
			}
		default:
			cout << "输入错误-月份不正确" << endl;
			break;
	}



	return 0;
}